#+TITLE: Songs to pave the seasons
#+INCLUDE: "../html-head.org"

I analyzed my Spotify data[fn:1] for the period 2016-2024, eight years of listening condensed into data;
yet the patterns it reveals are more about me[fn:2] than the music itself.

I processed everything in [[https://mlochbaum.github.io/BQN/index.html][BQN]], because its clarity suits both data and introspection. If you enjoy these
kinds of patterns, or just the music itself, IвҖҷm always glad to exchange thoughts.

** Technical details

The data come as a large JSON file exported from Spotify. Parsing it is straightforward
thanks to [[https://github.com/mlochbaum/bqn-libs][bqn-libs]]:

#+begin_src bqn :results none :tangle ../bqn/spodat.bqn
  вҹЁPвҮҗParseвҹ© вҶҗ вҖўImport "../../bqn-libs/json.bqn"
  @ вҠЈ spd вҶҗ P вҖўfile.Chars "../../supp/spdat/data.json"
#+end_src

For later queries I isolate the relevant fields (song index, artist, elapsed time)
and set the length of the desired result:

#+begin_src bqn :results none :tangle ../bqn/spodat.bqn
  sвҖҝaвҖҝmвҖҝl вҶҗ вҹЁ7, 8, 3, 1+вҶ•20вҹ©
#+end_src

Finally, I define a compact (50 chars) dyadic block function to perform ranked
lookups and return the top entries:

#+begin_src bqn :results none :tangle ../bqn/spodat.bqn
  Q вҶҗ {lвүҚЛҳвҲҫ(вҚ·рқ•ЁвҠёвҠҸЛҳ)ВЁ lвҠҸ ((вҚ’(+ВҙmвҠёвҠҸЛҳ)ВЁ)вҠёвҠҸ рқ•ЁвҠёвҠҸЛҳвҠҗвҠёвҠ”вҠў) >1вҠҸВЁ рқ•©}
#+end_src

** Top songs

The result is somewhat eclectic, yet a clear pattern emerges. Most pieces belong to a world of intricate
harmonies and long forms: during these years, it's been all about progressive rock and progressive metal.
A few simpler intrusions distort the spectrum; traces of another musical landscape I once inhabited.

#+begin_src bqn :exports both :tangle ../bqn/spodat.bqn
  s Q spd	
#+end_src

#+RESULTS:
#+begin_example
в”Ңв”Җ                                                     
в•ө 1  "Countless Skies"                                 
  2  "Divertimento I, K.136: Allegro"                  
  3  "The Numbers"                                     
  4  "Autre temps"                                     
  5  "Ghost of Perdition"                              
  6  "Crossing the Road Material"                      
  7  "HoppГӯpolla"                                      
  8  "Ether"                                           
  9  "Colossus"                                        
  10 "River"                                           
  11 "El Tete"                                         
  12 "Will o the Wisp"                                 
  13 "Pakumba"                                         
  14 "Damned Rope"                                     
  15 "Eternal Rains Will Come"                         
  16 "La femme d'argent"                               
  17 "Bajanda"                                         
  18 "Nimrodel - Medley"                               
  19 "Breathe (In The Air) - 2011 Remastered Version"  
  20 "In The Shadow Of Our Pale Companion"             
                                                      в”ҳ
#+end_example

** Top artists

The same tendency appears at the level of artists. I gravitate toward music that
builds worlds rather than merely expresses moods. Yet sometimes I descend to a simpler plane,
to enjoy the breeze down there, or simply to remember.

#+begin_src bqn :exports both :tangle ../bqn/spodat.bqn
  a Q spd
#+end_src

#+RESULTS:
#+begin_example
в”Ңв”Җ                              
в•ө 1  "Opeth"                    
  2  "Wolfgang Amadeus Mozart"  
  3  "Pink Floyd"               
  4  "Be'lakor"                 
  5  "Sigur RГіs"                
  6  "Coldplay"                 
  7  "Mogwai"                   
  8  "Chocolate Mc"             
  9  "Radiohead"                
  10 "JoaquГӯn Sabina"           
  11 "Iron & Wine"              
  12 "Rammstein"                
  13 "Alcest"                   
  14 "Buena Fe"                 
  15 "Silvio RodrГӯguez"         
  16 "Amon Amarth"              
  17 "In Mourning"              
  18 "Lamb of God"              
  19 "Camel"                    
  20 "Omnium Gatherum"          
                               в”ҳ
#+end_example

** Bonus: Opeth anthology

This is the Opeth album I would recommend to anyone. The query function needs to be modified a bit for generating it.
But before that, let's look at average album length in the [[https://www.opeth.com/releases/albums][official discography]]:

#+begin_src bqn :results none :exports both :tangle ../bqn/spodat.bqn
  lo вҶҗ (вҶ•вҲҳвҢҲ+ВҙГ·вү ) 7вҖҝ5вҖҝ9вҖҝ7вҖҝ8вҖҝ6вҖҝ8вҖҝ8вҖҝ7вҖҝ10вҖҝ7вҖҝ11вҖҝ10
#+end_src

We can then filter all Opeth entries among the top songs, and select the first =вү lo=:  

#+begin_src bqn :results none :tangle ../bqn/spodat.bqn
  O вҶҗ {lo (1вҠё+вҲҳвҠЈвүҚЛҳвҠҸ) (вҠўЛқЛҳвҠёвҲҠвҹңрқ•Ё/вҠҸЛҳ) вҲҫ(вҚ·sвҖҝaвҠёвҠҸЛҳ)ВЁ ((вҚ’(+ВҙmвҠёвҠҸЛҳ)ВЁ)вҠёвҠҸ sвҠёвҠҸЛҳвҠҗвҠёвҠ”вҠў) >1вҠҸВЁ рқ•©}
#+end_src

Enjoy this whisper within a sigh[fn:3]:

#+begin_src bqn :exports both :tangle ../bqn/spodat.bqn
  spd OЛңвӢҲ "Opeth" 
#+end_src

#+RESULTS:
#+begin_example
в”Ңв”Җ                             
в•ө 1 "Ghost of Perdition"       
  2 "River"                    
  3 "Will o the Wisp"          
  4 "Eternal Rains Will Come"  
  5 "The Drapery Falls"        
  6 "Elysian Woes"             
  7 "Burden"                   
  8 "Harvest"                  
                              в”ҳ
#+end_example

[fn:1] It is possible to request a detailed report of all user activity since the account was created. There are
some [[https://support.spotify.com/us/article/understanding-my-data/][interesting fields]] in the data, but more advanced information, such as genre, requires querying the
Spotify Web API, which is beyond the scope of this post.
[fn:2] Well, modulo all from =Tool= and =Silent state optimizer= from =Leech=, which are definitely in my top ten,
and which I listen to on YouTube. It's possible to analyze the [[https://takeout.google.com/settings/takeout][data]] from this site as wellвҖ”perhaps in a follow-up post.
[fn:3] Who am I kidding, this is definitely my favorite Opeth song.

#+INCLUDE: "../html-foot.org"
